Repository: RaghadTh24/AI-Enhanced_Electronics-_Rental_Platform.
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: ar

source: RentTech - Edit Profile
ar: RentTech - تعديل الملف الشخصي

source: Edit Profile
ar: تعديل الملف الشخصي

source: Username
ar: اسم المستخدم

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Email
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الجوال

source: ID Type
ar: نوع الهوية

source: ID Number
ar: رقم الهوية

source: Gender
ar: الجنس

source: Save Changes
ar: حفظ التعديلات

source: RentTech - Profile
ar: RentTech - الملف الشخصي

source: Home
ar: الرئيسية

source: Products
ar: المنتجات

source: Full Name:
ar: الاسم الكامل:

source: Username:
ar: اسم المستخدم:

source: Email:
ar: البريد الإلكتروني:

source: Phone Number:
ar: رقم الجوال:

source: ID Type:
ar: نوع الهوية:

source: ID Number:
ar: رقم الهوية:

source: Edit
ar: تعديل

source: Login
ar: تسجيل الدخول

source: User, Email or National ID
ar: اسم المستخدم, البريد الالكتروني, الهوية

source: Enter Your Password
ar: ادخل كلمة المرور

source: Not a member?
ar: لا تملك حساب؟

source: Signup now
ar: سجل الان

source: RentTech - Registration
ar: التسجيل - RentTech

source: Registration
ar: التسجيل

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Role
ar: نوع المستخدم

source: Register
ar: تسجيل

source: Chatbot - RentTech
ar: ال

source: Back
ar: العودة

source: RentTech Chatbot
ar: يي

source: Welcome to RENTTECH! How can I assist you today?
ar: مرحبا بك في RentTech كيف يمكنني مساعدتك؟

source: Type your message...
ar: اكتب رسالتك

source: Send
ar: ارسال

source: Welcome to RentTech
ar: مرحبًا بك في RentTech

source: Smart Electronic Device Rental Platform
ar: منصة ذكية لتأجير الأجهزة الإلكترونية

source: Rent the devices you need easily at the best prices.
ar: استأجر الأجهزة التي تحتاجها بسهولة وبأفضل الأسعار.

source: Contact Us
ar: اتصل بنا

source: Mail
ar: البريد الالكتروني

source: Mail Us
ar: راسلنا

source: Telephone
ar: الهاتف

source: Send Your Message
ar: أرسل رسالتك

source: Your Name
ar: اسمك

source: Your Email
ar: بريدك الإلكتروني

source: Phone
ar: الجوال

source: Your Phone
ar: رقم الجوال

source: Subject
ar: الموضوع

source: Leave a message here
ar: اترك رسالتك هنا

source: Message
ar: الرسالة

source: Send Message
ar: إرسال الرسالة

source: Privacy Policy
ar: سياسة الخصوصية

source: Information We Collect
ar: ال

source: We may collect personal information such as your name, email address, contact number, and payment details when you register or make a transaction.
ar: ال

source: How We Use Your Information
ar: ال

source: الYour information is used to provide and improve our services, process transactions, and communicate with you regarding updates or promotional content.
ar: ال

source: Data Security
ar: ال

source: We implement a variety of security measures to maintain the safety of your personal information.
ar: ال

source: Cookies
ar: ال

source: We use cookies to personalize your experience and analyze website traffic. You can choose to disable cookies through your browser settings.
ar: ال

source: Third-Party Sharing
ar: ال

source: We do not sell, trade, or otherwise transfer your personal information to outside parties without your consent, except when necessary to fulfill our services.
ar: ال

source: Your Rights
ar: ال

source: You have the right to access, correct, or delete your personal data. You can contact us to exercise any of these rights.
ar: ال

source: If you have any questions about this Privacy Policy, you can contact us at support@renttech.com.
ar: ال

source: Terms of Use
ar: شروط الاستخدام

source: 1. Acceptance of the terms
ar: ال

source: By using this site, you agree to be bound by all of these Terms of Use and any amendments thereto. If you do not agree to any of the terms, you may not use the site.
ar: ال

source: 2. Amendments to the Terms
ar: ال

source: We may modify these Terms at any time. Modifications will be posted on this page, and you should review the Terms periodically. Your continued use of the Site following any such modifications means you accept those changes.
ar: ال

source: 3. Device Rental Terms
ar: ال

source: Users must pay the applicable fees on time to use the rented devices. The rental period is determined during the checkout process, and may be extended based on device availability.
ar: ال

source: 4. Responsibility for rented equipment
ar: ال

source: The user bears full responsibility for the rented devices during the rental period. In the event of loss or damage to any device, the user is obligated to pay compensation based on the actual value of the device.
ar: ال

source: 5. Maintenance and Warranty
ar: ال

source: The company guarantees that the rented equipment is in good condition. However, if any technical malfunction occurs during the rental period, the equipment will be repaired or replaced according to the terms specified in the rental contract.
ar: ال

source: You must use the Site for lawful purposes only. You are prohibited from using the Site for any illegal activity or activity that violates any laws or regulations.
ar: ال

source: 7. Intellectual Property Rights
ar: ال

source: All content available on the Site, including text, images, and software, is the exclusive property of the Site or its authorized users. You may not copy, distribute, or reproduce any of the content without permission.
ar: ال

source: 8. Responsibility
ar: ال

source: 9. Applicable laws
ar: ال

source: These Terms are governed by the local laws of our country. Any dispute arising from this Agreement shall be resolved in accordance with these laws.
ar: ال

source: Your Service
ar: خدماتك

source: Profile
ar: الملف الشخصي

source: My Profile
ar: ملفي الشخصي

source: Rental
ar: ال

source: My Rental
ar: إيجاراتي

source: Chatbot
ar: ال

source: Communicate with chatbot
ar: التواصل مع روبوت المحادثة

source: My Rentals
ar: ال

source: Devices You Rented
ar: الاجهزة التي استأجرتها

source: From
ar: من

source: to
ar: الى

source: Rating
ar: تقييم

source: Mark as Returned
ar: علامة على الارجاع

source: Waiting for seller confirmation
ar: انتظر تأكيد البائع

source: Returned
ar: تم الارجاع

source: Rejected
ar: مرفوض

source: You haven’t rented any devices yet.
ar: لم تستأجر اي جهاز بعد

source: Rate Device
ar: قيم الجهاز

source: Rate Your Device
ar: قيم جهازك

source: Device Image
ar: صورة الجهاز

source: Write your comment here
ar: اكتب تعليقك هنا

source: Rating from 1 to 5
ar: قيم من 1 الى 5

source: Submit Rating
ar: ارسال التقييم

source: Please fill all fields correctly.
ar: فضلا املئ كل الحقول

source: Thank you! Your rating has been submitted.
ar: شكرا لك! تم ارسال تقييمك

source: An error occurred. Please try again.
ar: حدث خطأ ما. حاول مرة اخرى

source: Devices Management - Manager
ar: ادارة الاجهزة

source: Devices Management
ar: إدارة الأجهزة

source: Owner
ar: المالك

source: Price
ar: السعر

source: SAR/day
ar: ال

source: Delete
ar: حذف

source: No devices found.
ar: لم يتم العثور على أجهزة.

source: Manage the entire platform: analyze user sentiment, and moderate users and devices effectively.
ar: ال

source: Users Management
ar: إدارة المستخدمين

source: No comments available.
ar: لا توجد تعليقات متاحة.

source: Positive
ar: ايجابي

source: Negative
ar: سلبي

source: Neutral
ar: طبيعي

source: Users Management - Manager
ar: ادارة المستخدمين

source: User
ar: المستخدم

source: Role:
ar: نوع المستخدم

source: No users found.
ar: لم يتم العثور على مستخدمين.

source: List your electronic devices and start earning through seamless rentals.
ar: ال

source: My Products
ar: منتجاتي

source: Add Device
ar: اضافة جهاز

source: Delete Device
ar: حذف جهاز

source: Modify Device
ar: تعديل جهاز

source: Add Device - Seller
ar: ال

source: Add New Device
ar: ال

source: Device Name
ar: ال

source: e.g., Hp Computer
ar: ال

source: Specifications
ar: ال

source: Enter detailed specifications...
ar: ال

source: Price (SAR)
ar: ال

source: e.g., 150
ar: ال

source: Category
ar: ال

source: Select a Category
ar: تا

source: Computers
ar: كمبيوترات

source: Televisions
ar: تلفزيونات

source: Projectors
ar: بروجكترات

source: Printers
ar: طابعات

source: Cameras
ar: كاميرات

source: Speakers
ar: سماعات

source: Are you sure you want to delete "%(name)s"?
ar: هل أنت متأكد أنك تريد حذف "%(name)s"؟

source: Yes, Delete
ar: ال

source: Cancel
ar: ال

source: Delete Device - Seller
ar: ال

source: Device ID or Name
ar: ال

source: Enter Device Name or ID
ar: ال

source: Modify Device - Seller
ar: ال

source: Current Image
ar: ال

source: New Image (optional)
ar: ال

source: New Device Name
ar: ال

source: New Specifications
ar: ال

source: New Price (SAR)
ar: ال

source: New Device Image (optional)
ar: ال

source: Leave blank to keep unchanged
ar: ال

source: My Devices - RentTech
ar: تا

source: My Devices
ar: تا

source: Price:
ar: تا

source: Modify
ar: لا

source: The buyer marked this device as returned. Confirm?
ar: تت

source: Confirm Return
ar: تت

source: Reject
ar: تا

source: Returned Confirmed
ar: تا

source: Return Rejected
ar: ت

source: No devices added yet.
ar: فف

source: Devices - RentTech
ar: اا

source: Devices
ar: عع

source: Browse available
ar: عغ

source: for rent.
ar: ففل

source: Start From:
ar: تبدأ من

source: SAR
ar: تا

source: Rent Now
ar: بب

source: No devices found in this category.
ar: لل

source: Quick Links
ar: روابط سريعة

source: Signup
ar: انشاء حساب

source: Help & Support
ar: الدعم والمساعدة

source: Contact
ar: تواصل معنا

source: Device Details | RentTech
ar: اا

source: Availability:
ar: اا

source: Available
ar: اا

source: Unavailable
ar: اا

source: No ratings yet
ar: اا

source: Specifications:
ar: اا

source: Price per day:
ar: تا

source: Rental Duration (days):
ar: تت

source: Total Price:
ar: تت

source: Confirm Rental
ar: تت

source: This device is currently rented out.
ar: تت

source: Enter your email for notification
ar: اا

source: Notify Me
ar: تتت

source: View Similar Available Devices
ar: ىات

source: User Reviews
ar: مراجعات المستخدمين

source: No reviews yet.
ar: لا توجد مراجعات بعد.

source: Product keyword
ar: كلمة مفتاحية للمنتج

source: Categories
ar: التصنيف

source: Search
ar: ابحث

source: Latest Products
ar: احدث المنتجات

source: Browse our latest collection of electronic devices available for rent at the best prices. Get the technology you need, when you need it.
ar: ت

source: Added:
ar: ت

source: No products available at the moment.
ar: لا توجد منتجات متاحة حاليًا.

source: How it Works
ar: كيف يعمل؟

source: Create Account
ar: انشئ حساب

source: Choose Device
ar: اختر الجهاز

source: Confirm & Receive
ar: تأكيد واستلام

source: Order Summary - RentTech
ar: معلومات الطلب

source: Order Confirmed ✅
ar: تم تأكيد الطلب

source: Availability
ar: التوفر

source: Days Rented
ar: عدد ايام التأجير

source: day(s)
ar: الايام

source: Total Price
ar: السعر الاجمالي

source: Payment Method
ar: طريقة الدفع

source: Location
ar: الموقع

source: Back to Home
ar: العودة الى الصفحة الرئيسية

source: Payment - RentTech
ar: الدفع

source: Complete Your Payment
ar: اكمل الدفع

source: Rental Days
ar: مدة التأجير

source: Total Amount
ar: السعر الاجمالي

source: Choose Payment Method
ar: اختر طريقة الدفع

source: Cash
ar: كاش

source: Apple Pay
ar: بطاقة

source: Choose Your Location on Map
ar: اختر موقعك

source: Selected location will appear here
ar: موقعك

source: Confirm & Pay
ar: تأكيد الدفع

source: Apple Pay Checkout
ar: تت

source: Enter your Apple Pay info (mock)
ar: ادخل معلومات البطاقة

source: Card Number
ar: تت

source: Expiry
ar: تات

source: CVV
ar: اا

source: Pay
ar: ادفع

source: Products Categories
ar: تصنيف الاجهزة

source: Browse our collection of electronic devices available for rent at the best prices. Get the technology you need, when you need it.
ar: تت

source: Browse available %(category_lower)s for rent.
ar: الأجهزة المتاحة للإيجار في %(category_lower)s

source: Start From
ar: تبدأ من

source: Tel.
ar: رقم الهاتف

source: Mail.
ar: البريد الالكتروني

source: Available Devices
ar: الاجهزة المتوفرة

source: Available Devices in %(category)s
ar: الأجهزة المتوفرة في %(category)s

source: View Device
ar: عرض الجهاز

source: No available devices in this category at the moment.
ar: لا توجد أجهزة متاحة في هذا التصنيف حاليًا.

source: RentTech
ar: تت

source: Dashboard
ar: لوحة التحكم

source: Logout
ar: تسجيل الخروج

source: Close
ar: اغلاق

source: Designed and Developed by
ar: مصمم ومطور من قبل

source: Access Denied
ar: تم رفض الوصول

source: Go to Login
ar: الذهاب لتسجيل الدخول
